app/Models/categoriasModel.php

    public function addProducto($data){

        $db = \Config\Database::connect();
        $db->table('productos')->insert($data);
---
INSERT INTO `productos` (`Nombre_producto`, `Referencia`, `Precio`, `Peso`, `Categoria`, `Stock`, `Fecha_creacion`) VALUES ('radio', 'wer', '345677', '12', 'dfg', '12', '2023-07-18')

    public function addVenta($data){

        $db = \Config\Database::connect();
        $db->table('ventas')->insert($data);
---
INSERT INTO `ventas` (`idproducto`, `cantidadproducto`) VALUES ('9', '12')

    public function restarStock($id, $cant,  $stock){
       $cac=$stock-$cant;
        $db = \Config\Database::connect();
        $builder =$db->table('productos');
        $builder->set('Stock', $cac, false);
        $builder->where('ID', $id);
        $builder->update();
---
UPDATE `productos` SET `Stock` = 1
WHERE `ID` = '9'

    public function actualizarProducto($id, $data){

        $db = \Config\Database::connect();
        $builder = $db->table('productos')->where('ID', $id);
        $builder->update($data);
---
UPDATE `productos` SET `Nombre_producto` = 'jhjj', `Referencia` = 'jhj', `Precio` = '12', `Peso` = '3', `Categoria` = 'vbbvnb', `Stock` = '1', `Fecha_creacion` = '2023-07-18'
WHERE `ID` = '9'

    public function eliminarproducto($id){

        $db = \Config\Database::connect();
        $builder = $db->table('productos')->where('ID', $id);
        $builder->delete();
---
DELETE FROM `productos`
WHERE `ID` = '10'